Revit 2027 API
PipePressureDropData.FrictionFactor Property
 The friction factor of the pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FrictionFactor { get; set; }
Public Property FrictionFactor As Double
	Get
	Set
public:
property double FrictionFactor {
	double get ();
	void set (double value);
}
member FrictionFactor : float with get, set
Property Value
Double
See Also
Reference
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace